export const ruleData = `
    <h1>Публичная оферта на предоставление права пользования программным продуктом</h1>
    <br/>
    <br/>
    <p>1.1. Общество с Ограниченной Ответственностью «Norma» в лице директора Перпера М.М., именуемое в дальнейшем «Правообладатель», настоящим предоставляет физическим лицам, акцептирующим настоящую оферту путем выполнения оговоренных ниже действий (далее - «Пользователь»), право пользования программным продуктом «Norma Online – информационно-поисковые и экспертные системы» (далее – «ПП «Norma Online»), включающего в себя базы данных информационно-поисковых и электронных справочных систем «Norma» в онлайн режиме, а также функционал сайта <a href="http://nrm.uz" target="_blank" rel="noopener noreferrer" aria-label="Norma Online">http://nrm.uz</a> (далее - Сайт) в соответствии с нижеследующими условиями. Правообладатель и Пользователь далее совместно именуются «Стороны», а по отдельности – «Сторона».</p>
    <br/>
    <p>1.2. Оплата по настоящей Оферте признается ее Акцептом, т.е. полным и безоговорочным принятием всех условий данной Оферты и всех ее приложений.</p>
    <br/>
    <p>1.3. Договор между Правообладателем и Пользователем считается заключенным с момента акцепта на нижеследующих условиях.</p>
    <br/>
    <br/>
    <h2>2. Предмет договора</h2>
    <br/>
    <p>2.1. Правообладатель предоставляет право пользования ПП «Norma Online» Пользователю в сроки, определенные в выбранном Пользователем тарифе, являющимся неотъемлемой частью настоящей оферты. Оплата за пользование ПП «Norma Online» производится в размере, порядке и сроки, предусмотренные настоящим договором. Информация о доступных тарифах размещена на Сайте.</p>
    <br/>
    <p>2.2. Ознакомившись с условиями настоящей Оферты и согласившись с ними, Пользователь выбирает походящий ему тариф, проходит процедуру регистрации (заполняет соответствующую анкету с обязательным указанием e-mail адреса), подтверждает свой e-mail адрес (активирует учетную запись), выбирает способ оплаты (система «Click», SMS-tulov, ЕОПЦ и другие) и производит оплату согласно выбранному тарифу, получает подтверждение о предоставлении доступа к ПП «Norma Online».</p>
    <br/>
    <p>2.3. После поступления денежных средств на расчетный счет Правообладателя Пользователю в течение 1 (одного) часа автоматически формируется срочный доступ к ПП «Norma Online» в соответствии с условиями выбранного тарифа.</p>
    <br/>
    <p>2.4. Течение срока пользования ПП «Norma Online» начинается с даты и времени получения подтверждения о предоставлении доступа к базам данных и функционалу Сайта в соответствии с условиями выбранного тарифа.</p>
    <br/>
    <p>2.5. Пользователь обязан обеспечить следующие минимальные программно-технические требования для полноценного функционирования Сайта: частота процессора не ниже 433 МГц, ОЗУ не ниже 128 Мb, один из веб-браузеров - MS Internet Explorer версии не ниже 6.0, Opera версии не ниже 9, Mozilla FireFox 2-3, приложение Adobe Acrobat Reader, а также подключение компьютера к сети Интернет на скорости не менее 33,6 кбит/с.</p>
    <br/>
    <p>2.6. Актуализация баз данных Сайта осуществляется Правообладателем еженедельно в плановом порядке.</p>
`;
