export const reviewsData = [
  {
    id: 0,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 4.9,
  },
  {
    id: 1,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 4.3,
  },
  {
    id: 2,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 4.5,
  },
  {
    id: 3,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 5.0,
  },
  {
    id: 4,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 1.4,
  },
  {
    id: 5,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 1.2,
  },
  {
    id: 6,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 3.9,
  },
  {
    id: 7,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 3.8,
  },
  {
    id: 8,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 3.5,
  },
  {
    id: 9,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 2.5,
  },
  {
    id: 10,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 1.5,
  },
  {
    id: 11,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 4.8,
  },
  {
    id: 12,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 2.5,
  },
  {
    id: 13,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 3.5,
  },
  {
    id: 14,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 4.2,
  },
  {
    id: 15,
    review:
      "Экран является как жирным плюсом, так и большим минусом. Цвета очень контрастные и сочные, но сама цветопередача не натуральных оттенков. OLED также обладает ШИМ'ом, для людей с чувсвтительными глазами это может быть серьезным недостатком, советую попользоваться телефоном перед покупкой.",
    date: "2022-08-21T13:42",
    rate: 5.0,
  },
];
