import React, { useState } from "react";
import QuestionsAndAnswersPageStyle from "./style";
import { useTranslation } from "next-i18next";
import AccordionItem from "../../../components/desktop/accordion_item";

interface PageProps {}

const data = [
  {
    id: 0,
    title: "Публикуйте объявления о продаже и заключайте успешные сделки",
    description:
      "После добавления детального описания и публикации объявления вам останется только дождаться откликов покупателей. Вы также можете рекламировать ваши объявления, чтобы о них узнало больше людей. Отвечайте на вопросы покупателей, предоставьте им больше информации о товаре и договоритесь о цене.",
  },
  {
    id: 1,
    title: "Как опубликовать объявление?",
    description:
      "После добавления детального описания и публикации объявления вам останется только дождаться откликов покупателей. Вы также можете рекламировать ваши объявления, чтобы о них узнало больше людей. Отвечайте на вопросы покупателей, предоставьте им больше информации о товаре и договоритесь о цене.",
  },
  {
    id: 2,
    title: "Как начать общение в чате?",
    description:
      "После добавления детального описания и публикации объявления вам останется только дождаться откликов покупателей. Вы также можете рекламировать ваши объявления, чтобы о них узнало больше людей. Отвечайте на вопросы покупателей, предоставьте им больше информации о товаре и договоритесь о цене.",
  },
  {
    id: 3,
    title: "Как я смогу получить товар, после оплаты покупки?",
    description:
      "После добавления детального описания и публикации объявления вам останется только дождаться откликов покупателей. Вы также можете рекламировать ваши объявления, чтобы о них узнало больше людей. Отвечайте на вопросы покупателей, предоставьте им больше информации о товаре и договоритесь о цене.",
  },
  {
    id: 4,
    title:
      "Что делать, если продавец закрыл объявление, а товар мне очень интересен?",
    description:
      "После добавления детального описания и публикации объявления вам останется только дождаться откликов покупателей. Вы также можете рекламировать ваши объявления, чтобы о них узнало больше людей. Отвечайте на вопросы покупателей, предоставьте им больше информации о товаре и договоритесь о цене.",
  },
  {
    id: 5,
    title: "Какие способы оплаты существуют?",
    description:
      "После добавления детального описания и публикации объявления вам останется только дождаться откликов покупателей. Вы также можете рекламировать ваши объявления, чтобы о них узнало больше людей. Отвечайте на вопросы покупателей, предоставьте им больше информации о товаре и договоритесь о цене.",
  },
];

const QuestionsAndAnswersPage = (props: PageProps) => {
  const {} = props;
  const { t } = useTranslation();
  const [activeIndex, setActiveIndex] = useState<number | null>(null);

  return (
    <QuestionsAndAnswersPageStyle className="page_wrapper">
      <h1>{t("q&a")}</h1>
      <div className="container">
        {data.map((item) => (
          <AccordionItem
            key={item.id}
            data={item}
            activeIndex={activeIndex}
            setActiveIndex={setActiveIndex}
          />
        ))}
      </div>
    </QuestionsAndAnswersPageStyle>
  );
};
export default QuestionsAndAnswersPage;
